// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б

// function sp (a,b) {
//     return a*b;
// }
// console.log(sp(20, 30));


// - створити функцію яка обчислює та повертає площу кола з радіусом r

// let Pi = 3.14;
// function func(Pi,r) {
//     return Pi * r * r
// }
//
// console.log(func(Pi, 10));

// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r

// function hr(h,r) {
//     return 2 * Math.PI * r * (h + r)
// }
// console.log(hr(10, 20));

// - створити функцію яка приймає масив та виводить кожен його елемент

// let array = [1, 2, 3, 4];
// function func(arr) {
//     console.log(arr)
// }
// func(array);


// - створити функцію яка створює параграф з текстом. Текст задати через аргумент

//  function func(someText) {
//     document.write(`<p>${someText}</p>`)
//  }
// func('Hello')

// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13